yiistudy/modules/models/Admin.php

    public function validatePass()
    {
        if (!$this->hasErrors()) {//如果前面无错误  进行查询
            $data = self::find()->where('adminuser = :user and adminpass = :pass', [":user" => $this->adminuser, ":pass" => md5($this->adminpass)])->one();
---
SELECT * FROM `shop_admin` WHERE adminuser = 'admin' and adminpass = '202cb962ac59075b964b07152d234b70'

    public function validateEmail()
    {
        if (!$this->hasErrors()) {//如果前面无错误  进行查询
            //查询该用户的邮箱是否匹配
            $data = self::find()->where('adminuser = :user and adminemail = :email', [':user' => $this->adminuser, ':email' => $this->adminemail])->one();
---
SELECT * FROM `shop_admin` WHERE adminuser = 'admin' and adminemail = 'shop@imooc.com'

    public function login($data)
    {
        $this->scenario = "login"; //指定使用场景
        //$this->load($data)    数据压入当前对象
        //$this->validate()    进行数据验证
        if ($this->load($data) && $this->validate()) {  //成功返回真 进行处理
            //做点有意义的事
            $lifetime = $this->rememberMe ? 24*3600 : 0;   //如果点击了记住我  则设定时间  否则为0
            $session = Yii::$app->session;    //调用session   记得加载yii类
            session_set_cookie_params($lifetime); //设定session有效期
            $session['admin'] = [            //session 存值
                'adminuser' => $this->adminuser, //用户名
                'isLogin' => 1,//是否登录
            ];
            //更新用户登录信息
            $this->updateAll(['logintime' => time(), 'loginip' => ip2long(Yii::$app->request->userIP)], 'adminuser = :user', [':user' => $this->adminuser]);
---
UPDATE `shop_admin` SET `logintime`='1489542020', `loginip`='2130706433' WHERE adminuser = 'admin'